# 지역 코드 정의
LOCAL_CODES = {
    1: "서울",
    2: "부산광역시",
    3: "대구광역시",
    4: "인천광역시",
    5: "광주광역시",
    6: "대전광역시",
    7: "울산광역시",
    8: "세종특별자치시",
    9: "경기도",
    11: "충청북도",
    12: "충청남도",
    13: "전라북도",
    14: "전라남도",
    15: "경상북도",
    16: "경상남도",
    17: "제주특별자치도",
}

# 카테고리 정의
DAMAGE_CATEGORIES = {
    "재난/재해": {
        "earthquake_fire": "지진/산불",
        "typhoon": "태풍/호우",
        "snowstorm": "폭설"
    },
    "병해충": {
        "disease": "병해",
        "pest": "해충"
    }
}